samples/expression_bdd_dot/complex.dot
digraph bdd {
  rankdir=TB;
  "node000" [label = "a", style = "filled", name = "node000", shape = "circle"];
  "node001" [label = "b", style = "filled", name = "node001", shape = "circle"];
  "node002" [label = "c", style = "filled", name = "node002", shape = "circle"];
  "node003" [label = "d", style = "filled", name = "node003", shape = "circle"];
  "node004" [label = "d", style = "filled", name = "node004", shape = "circle"];
  "node005" [label = "e", style = "filled", name = "node005", shape = "circle"];
  "node006" [label = "0", style = "filled", name = "node006", shape = "box", fillcolor = "lightgray"];
  "node007" [label = "1", style = "filled", name = "node007", shape = "box", fillcolor = "lightgray"];
  "node000" -> "node001" [style = "solid"];
  "node000" -> "node007" [style = "dashed"];
  "node001" -> "node002" [style = "dashed"];
  "node001" -> "node005" [style = "solid"];
  "node002" -> "node003" [style = "dashed"];
  "node002" -> "node004" [style = "solid"];
  "node003" -> "node005" [style = "solid"];
  "node003" -> "node007" [style = "dashed"];
  "node004" -> "node005" [style = "dashed"];
  "node004" -> "node007" [style = "solid"];
  "node005" -> "node006" [style = "dashed"];
  "node005" -> "node007" [style = "solid"];
}
